{"KEY DATAPOINTS": {"ID": "", "FILENAME": "A3_ACKA_LSS_and_CTG_DV_Flow_Drift_Failure.json", "DIVISION": "", "BU": "PL", "PRODUCT LINE": "", "PRODUCT GROUP": "", "DEPARTMENT": "I", "LOCATION": "Newport News  VA", "AUTHOR": "Josh Hatfield", "SPONSOR": "Barry Hindman", "TEAM LEADER": "Josh Hatifeld", "START DATE": "2019-08-05T00:00:00", "END DATE": "2020-11-10T00:00:00", "LATEST UPDATE": "2020-11-10T00:00:00", "PROBLEM DESCRIPTION": "WO# K150-08, Deka 10 TP1008 DV dynamic lean shift failure observed In RSG E-10 test bench mechanical durability per S1297 Injectors were manufactured in Prototype Services May 29, 2019. Configuration: 12.55mm OD,Extra Short, 10mm Tip, Schaleger MPG, NPN ATB, NPN LSS", "CURRENT CONDITION": "Specification (+5% / -3%) 200M Audit: 47362 = -10.1%, 47371 = -6.2%, 47384 = -6.1% 300M Audit: 4742 2= -6.7%, 47421 = -3.3% *Reference 8D ES191216231144 for additional dynamic lean failures", "TARGET CONDITION": "Twenty four of twenty-four injectors successfully pass test bench mechanical durability per S1297 in RSG E-10", "ROOT CAUSE ANALYSIS": "Reference 8D ES 191216231144 for detailed analysis of root cause hypotheses of design robustness RCH2 - Deka 10 design and process variation introduces inherent variability, resulting in isolated occurrences dynamic lean shift observation Why does dynamic lean shift occur in a percentage of the test population? Dynamic lean shift occurs due to an increase in opening time, and variation in opening time is seen part to part Why does opening time variation occur? Opening time variation is a resultant of variation in wear severity at the sealing interface Why is variation seen in ball to seat sealing band wear? Wear variation is a resultant of design robustness sensitivity to design and process parameter variation Why was variation of design and process parameters influence on dynamic shift not captured in Deka 10 CTG 8D S180711224450? Overall variation in small controlled builds not captured, resulting in small occurrence of flow shift being observed outside of the defined specification due to sensitivity and lack of robustness against the stack-up", "COUNTERMEASURES": "1. Review of defined dynamic tolerance vs system sensitivity to absolute flow (flow shift from nominal) compared to testing definition of shift from baseline. Resp. NCS, Status: Complete -> +8% shift from nominal capability (slide 15) 2. Determine injector flow shift capability in test bench RSG E-10 mechanical durability from nominal vs. baseline, Resp. J. Hatfield, Status: Complete - +8% from nominal results in capability of CpK = 1.27 (slide 16) Upper Limit Lower Limit CpK Test Samples Out of Spec Shift from Baseline Shift from Nominal", "EFFECT CONFIRMATION": "AMC PV6 (L062-05) PV8 (L113-03) and PV9 (L209-03, L209-04) were analyzed for dynamic flow shift from nominal while introducing end of test line variability to determine the product robustness vs. system sensitivity to absolute flow. The analysis shows a capability of 1.27 to the allowable flow shift defined by the Non-Auto system integration team", "FOLLOW UP ACTION": "Reference 8D ES191216231144 for follow up actions"}, "SEARCH PARAMETERS": {"KEY WORDS": ["Deka 10 TP1008", "E", "S1297", "RCH2 - Deka 10", "Deka 10", "CTG 8D S180711224450", "RSG E-10"], "KEY PHRASES": ["WO", "# K150-08", "Deka 10 TP1008 DV dynamic lean shift failure", "RSG E-10 test bench mechanical durability", "S1297 Injectors", "Prototype Services", "May 29, 2019", "Configuration", "12.55mm OD", "Extra Short", "10mm Tip", "Schaleger MPG", "NPN ATB"]}}