{"KEY DATAPOINTS": {"ID": "", "FILENAME": "A3_CVT_Incorrect_Display.pdf", "DIVISION": "", "BU": "EC", "PRODUCT LINE": "", "PRODUCT GROUP": "", "DEPARTMENT": "DT", "LOCATION": "ICH", "AUTHOR": "Sohyun Min", "SPONSOR": "Namyong Kim", "TEAM LEADER": "", "START DATE": "2020-09-07T00:00:00", "END DATE": "2021-01-18T00:00:00", "LATEST UPDATE": "2021-01-18T00:00:00", "PROBLEM DESCRIPTION": "1) What vehicle CN7/CN7a 2) Product SIM3K-541, SW version 6VA600 3) Who issued HMMA QC 4) How HMMA QC reported that '5' instead of 'D' was displayed for the select lever switch information via UDS $22 in Roll &Brake process of CN7 vehicle. And compared to the project Nu ATK CVT, different value was displayed for D range. 5) Containment action 9,124EA to be reprogrammed in HMMA plant", "CURRENT CONDITION": "1) Current $01A0 in UDS $22 service D is defined by '5'. Lever Switch Displayed via GDS before changing 2) Impact: Roll and brake test in customer plant cannot be passed due to wrong gear information from TCU", "TARGET CONDITION": "1) Target Customer requirement delivered at Nu ATK project $01A0 in UDS $22 service D is defined by '8'. Select Lever Switch Displayed via GDS after changing Manual Mode 12", "ROOT CAUSE ANALYSIS": "in Nu ATK CVT Spec was only SWCN canceled Why Why Why Wrong managem spec and sw) wrong value was not set back value from $22 service Spec ewed was with not revi reference for UDS Why for not used to review er requirement 6VA project Customer require d based on spec for the test", "COUNTERMEASURES": "# Potential solutions (linked to the problems root cause) Prioritization (A, B, C) 1 UDS $22 & $2F service spec will be reviewed with customer requirement even the project is not pilot. A1 2 UDS $22 & $2F service test will be performed with customer requirement A1 3 Every release, spec and SW matching will be checked based on canceled RO in old LIMAS used project C3 4 UDS $22 & $2F service test will be performed by the G-SCAN tool ( GDS mobile ) in the step of final validation. B2 5 Spec and SW of 6VA will be modified to display D with hex value \"8\" A1 6 6V2 spec will be set back A2 Quick Wins To be Complexity of implementation (Efforts) Set up actionplan for implementing the chosen solution # Action Who due date status comment 1 Spec and SW of 6VA will be modified to display D with hex value \"8\" Developer/PMe 9/3 Closed SW was modified and delivered to customer. 2 6V2 spec will be set back. PMe 9/30 Closed Wrong spec set back and blue book was updated. 3 UDS $22 & $2F service spec will be reviewed with customer requirement even the project is not pilot. Developer/Review er/PMe From the next project Closed System requirement review based on customer requirement will be performed and this strategy was shared throughout the meeting. . Refer to the attached mail for the detail discussion result RE Lesson Learned System Final Test Cx ñ °ÃÉ 4 UDS $22 & $2F service test will be performed with customer requirement, Test engineer/PMe From the next project Closed The test with GDS mobile shall be performed and this test will be performed based on customer requirement 5 UDS $22 & $2F service test will be performed by the G-SCAN tool GDS mobile) in the step of final validation. Test engineer/PMe 30.Oct.2020 for CN7 From the next project Closed RI X Refer to the attached e-mail for discussion result GDS ÀizëÇÑ PCU Ág Learned System Final Test çx.ñ °OAI 6 Every release, spec and SW matching will be checked based on canceled RO in old LIMAS used project Developer/PMe From the next release Closed It will be checked during the Q review for release.", "EFFECT CONFIRMATION": "The select lever position information via UDS $22 is normally displayed as \"D\" with modified SW (6VA610)", "FOLLOW UP ACTION": "Yokoten : history deliver to further project via UDS test method with GDS mobile"}, "SEARCH PARAMETERS": {"KEY WORDS": ["CN7/CN7a", "HMMA", "CN7", "Nu ATK", "CVT"], "KEY PHRASES": ["vehicle CN7/CN7a 2", "Product SIM3K-541", "SW version 6VA600 3", "HMMA QC 4", "HMMA QC", "the select lever switch information", "UDS", "Roll &Brake process", "CN7 vehicle", "the project Nu ATK CVT", "different value", "D range", "Containment action"]}}