{"KEY DATAPOINTS": {"ID": "", "FILENAME": "A3_DME_MSD87_Rolls_Royce_Flashprotection.json", "DIVISION": "", "BU": "ES", "PRODUCT LINE": "", "PRODUCT GROUP": "", "DEPARTMENT": "ES", "LOCATION": "Regensburg", "AUTHOR": "Patrick Bräutigam", "SPONSOR": "Stefan Fiedler", "TEAM LEADER": "Michael Urbanek", "START DATE": "NaT", "END DATE": "NaT", "LATEST UPDATE": "2018-07-20T00:00:00", "PROBLEM DESCRIPTION": "09.07. BMW (Rolls Royce) communicated an issue @plant Goodwood. Problem only with D-sample ECU together with 18-07-530 B88 software and affected datasets concerning the synchronization of the immobilizer (EWS elektronische Wegfahrsperre); key is not writeable with any tooling anymore. Further investigation showed that the re-programming of the ECU (MSD87 - 12 cylinder) is not possible anymore for some dataset variants of the SW B88 (e.g.: RR4 US BB / RR5 US / RR6 US BB).", "CURRENT CONDITION": "Initial status: An analysis of locked ECUs showed that only SW variants which have an activated anti jerk function are affected. BMW Customer part#: 9453018-01 (SW 9SP9B88S) Upd. 13th of July: Customer updated all data variants of the SW B88 with calibration workaround and deactivated anti jerk function. Upd. 18th of July: One cycle resume command of the controller enable the flash protection during start up and locked the ECU; SW update planned for SW C00 in CW31 (activation of anti jerk is possible again).", "TARGET CONDITION": "Goal is to analyze the ECU hardware and the affected B88 software and the calibration data to fix both issues (immobilizer sync & reprogramming).", "ROOT CAUSE ANALYSIS": "Trigger is \"anti jerk\" function that activates flash protection and it is not possible to reprogram the ECU Only D-samples (serial parts) are affected. Some flash containers of SW version B86 to B88 show this behavior (BMW stated). Continental analysis of the various effected vehicle variants (e.g.: RR4 US BB / RR5 US / RR6 US BB) gave a hint to some special calibration data variant (activation of anti jerk function). BMW confirmed this finding with a crosscheck (deactivation of anti jerk function) in an affected calibration variant. To understand the root cause debugging of a D-sample ECU is necessary. A new ECU with Lauterbach access has to be built up for debugging. A changed S-Boot is necessary for debugger access. Switch is necessary to disable the Monitoring Unit (MU) and the Watchdog (WD). Debugging showed an issue that occurs due to copy process of the flash memory which is necessary for application ECUs but not for serial ECU samples. This process caused an Single Cycle Resume Command, which enables the Flash Protection. Therefore at least on one of the four addresses A0045554 / A0055554 A0065554 / A0075554 must have the value \"5E\" so that the flash protection is activated. One of these four addresses is used by the anti jerk function.", "COUNTERMEASURES": "B88 with calibration workaround already done by BMW on13th of July COO with deactivation of root cause (memory copying process) Software update planned for 31st of July Which other SW variants / BMW projects could be affected All MSD87 12 cylinder SW variants since 2005 (SOP) are affected with this issue All other BMW projects are not affected (memory copying process deactivated for serial ECU samples) Check of other critical Single Cycle Flash Commands Script for automated dataset check available for BMW right now.", "EFFECT CONFIRMATION": "Deactivation of anti jerk function) in an affected calibration variant in B88 to check if the flash process works - Deactivation of copying process and crosscheck if the flash process works in combination with activated anti jerk function is working (addresses A0045554 / A0055554 / A0065554 / A0075554 must have the value \"5E\") - Check of ECU returns from customer BMW caused by a flash lock during end of line test.", "FOLLOW UP ACTION": "- B88 with calibration workaround Upd 1.21.08: C00 SW is replacing B88 in all car variants - C00 Software update planned for 31st of July. Upd. 21.08.: done; SW submitted End of July. Automated dataset check with the Continental Script for all dataset updates to software variants until C00 by customer BMW. Upd. 21.08.: tool based checkup of all relevant \"singe cycle flash commands\" are created and submitted to customer"}, "SEARCH PARAMETERS": {"KEY WORDS": ["BMW", "Rolls Royce", "plant Goodwood", "B88", "EWS", "MSD87 - 12 cylinder", "B86", "Lauterbach"], "KEY PHRASES": ["BMW", "Rolls Royce", "an issue @plant Goodwood", "Problem", "D-sample ECU", "18-07-530 B88 software", "affected datasets", "the synchronization", "the immobilizer", "EWS elektronische Wegfahrsperre", "key", "any tooling", "Further investigation", "the re-programming", "the ECU", "MSD87 - 12 cylinder", "some dataset variants", "the SW B88", "e.g.", "RR4 US BB", "RR5 US / RR6 US BB"]}}