{"KEY DATAPOINTS": {"ID": "", "FILENAME": "A3_Deka_7_Stuck_Closed.pdf", "DIVISION": "", "BU": "EC", "PRODUCT LINE": "", "PRODUCT GROUP": "", "DEPARTMENT": "PLH", "LOCATION": "NPN", "AUTHOR": "B  Hindman", "SPONSOR": "Barry Hindman", "TEAM LEADER": "B  Hindman", "START DATE": "2021-08-17T00:00:00", "END DATE": "NaT", "LATEST UPDATE": "2022-05-20T00:00:00", "PROBLEM DESCRIPTION": "Injectors mechanically inoperable after 400 cycles of thermal shock, functional issues noted since 100 cycles TP 7072: M084U28120 M084U29625, TP7363: M085K27336 Containment Action - NPN - within Validation", "CURRENT CONDITION": "Deka 7 transfer for CGQ Thermal Shock test S1331 500 Shocks; Qd +4/-4% Shift from baseline TP7072 - ER1149 (WO#M123-02), TP7363 - ER1150 (WO#M123-08) Short Standard tip", "TARGET CONDITION": "- Product functionality remains post air-air thermal shock testing", "ROOT CAUSE ANALYSIS": "- RCH1: Handling damage - No visual damage found on inspection Not RCH RCH2: Issue with Exsol D40 used as calibration fluid Not RCH (review FTIR results) RCH3 Contamination introduced in assembly process -> Not RCH Injector M085K27336 was sumberged in n-Heptane for 24 hours, post soak injector returned to nominal flow values RCH4: Fluid introduced post injector assembly Primary RCH RCH4.1: Functional Bench Fluid - Not RCH RCH4.2: O-ring lubrication -> Confirmed RCH Mineral oil confirmed to match residue observed within stuck injectors IN-062802/IN-062803 (cell 6/cell 7) instructs technician to lightly lubricate upper injector oring prior to insertion in test head", "COUNTERMEASURES": "Create Procedure/Instruction document for Cell 9 including statements about o-ring lube application (see verbiage in IN-062802/IN-062803). Resp. J. Copeland, due: 31 Mar 2022 > IN-96627953 in eSign for approval (esign 50324386) COMPLETE Create (Preventative) Maintenance document for Cell 9 with intervals for filter and fluid changes. Resp. J. Copeland, due: 31 Mar 2022 > PM document reviewed and sent back to author for revisions, 4/11 COMPLETE", "EFFECT CONFIRMATION": "1. Repeat thermal exposure of sample of n-Heptane from Cell 9 to verify removal of orange/brown residue-causing contaminant. Resp. B. Hindman, due: 6 May 2022 COMPLETE 2. TBD based on future transfer validations (that include thermal exposure)", "FOLLOW UP ACTION": "-Complete thermal exposure of sample of N-Heptane from cell 9 to see if orange/brown residue remains (try to get enough for FTIR analysis). Resp. M. Mosser COMPLETE -Change test fluid/filter in cell 9 (after test above). Resp. J. Copeland COMPLETE 3/14/2022 -Filter and fluid changed again in Cell 9 with re-sample taken on 4/27/22 (see slide 11-12 results) COMPLETE See ES2110012503951 for incident regarding Deka IV/V."}, "SEARCH PARAMETERS": {"KEY WORDS": ["TP", "M084U28120", "M084U29625", "M085K27336", "Exsol D40"], "KEY PHRASES": ["Injectors", "400 cycles", "thermal shock", "functional issues", "100 cycles", "TP 7072", "M084U28120 M084U29625", "TP7363", "M085K27336 Containment Action"]}}