{"KEY DATAPOINTS": {"ID": "", "FILENAME": "A3_ES210928205803_DDU_Spray_Cone_Low.json", "DIVISION": "Diesel", "BU": "ExAT", "PRODUCT LINE": "", "PRODUCT GROUP": "", "DEPARTMENT": "PLH", "LOCATION": "Pisa  IT", "AUTHOR": "", "SPONSOR": "Claudio Bientinesi", "TEAM LEADER": "Luca Soriani", "START DATE": "2021-09-28T00:00:00", "END DATE": "2021-11-10T00:00:00", "LATEST UPDATE": "2021-11-10T00:00:00", "PROBLEM DESCRIPTION": "Spray angle ranging from 36,7° to 69,0°O PV parts (spec allow 70°+25°)", "CURRENT CONDITION": "Out of specification spray angle for DDU transfer PV parts, Specification allows 70°+25°, parts observed as low as 36° Situation pertains to both GM and HMC parts produced for transfer PV, but not to Ford parts No containment needed - parts not being produced for customer, only for PV", "TARGET CONDITION": "All parts produced within 70°+25° specification", "ROOT CAUSE ANALYSIS": "Supplier change for DDU lower housing (LH) (NPN components Texeido) and obsolete machinery used to produce the part resulted in the update of certain LH print dimensions to reduce leak failures. This resulted in a valve that was more recessed inside the LH than normal NPN production parts and the risk of having some parts out of spec for spray cone angle. )These parts are identified as Loop 1) This issue was able to be turned on and off by varying the amount by which the valve was", "COUNTERMEASURES": "Reducing the amount the valve was recessed was found to mitigate the risk of cone angle of spec while also avoiding the risk of leak failures. The final nominal value chosen was between the production maximum recessed value and the Loop 1 minimum recessed value (actual values below). Loop 1 Amount Pin Recessed: Loop 2 Normal Production Pin LSL Loop 2: 0,07+0,04 Pin USL Sharp edge Dia OPT3", "EFFECT CONFIRMATION": "PV Loop 2 spray angle testing. (PV Loop 1 is used to verify the parts against all of the standard tests in VT spec S1268. PV Loop 2 is used to verify the Loop 2 LH against the functional requirements, including spray cone angle.) 100% of parts passed PV Loop 2 with results equivalent to production parts from NPN. Design has been finalized with supplier 94% FPY for poppet Mass Flow Test indicated design update successful", "FOLLOW UP ACTION": ""}, "SEARCH PARAMETERS": {"KEY WORDS": [], "KEY PHRASES": ["Spray angle", "36,7° to 69,0°O PV parts", "spec"]}}