{"KEY DATAPOINTS": {"ID": "", "FILENAME": "A3_Ford_FOX_UPG_Injector_Leakage_Due_to_VB_chips.json", "DIVISION": "P", "BU": "ES", "PRODUCT LINE": "", "PRODUCT GROUP": "", "DEPARTMENT": "PL", "LOCATION": "CGQ", "AUTHOR": "Zhang Kaidong", "SPONSOR": "", "TEAM LEADER": "Zhang Kaidong", "START DATE": "2018-12-11T00:00:00", "END DATE": "2018-12-27T00:00:00", "LATEST UPDATE": "NaT", "PROBLEM DESCRIPTION": "When: On Dec.5th.2018, CAF CQ3 found one piece injector stuck open during vehicle testing. What: The chips from VB was found in the seat sealing area after tear down injector on Dec. 11st.2018 Which supplier of VB: Asimco Beijing Picture 1 2 - Containment action: Dec.10th.2018: Fast response to customer and send back the suspected part. 100% VB sorting in CGQ plant and supplier side. No chips part was", "CURRENT CONDITION": "", "TARGET CONDITION": "Confirm the root cause in supplier side and implement prevention action in production line. B. Find Root cause of Problem / Issue", "ROOT CAUSE ANALYSIS": "Cause 1: One pcs of debug part was mixed into good parts by debug technician. Check the FTQ ( scrap record), only one piece (chips defect) part is missed in the record. Suspect part was produced on Jun.26.2018 in supplier side, the equipment manufacturer did the annual calibration on that day according to record on that day. Cause 2: Incorrect the length of drilling tool during debug Repeat the same failure mode with incorrect length 53.29mm of drilling tool The chip occur after change the length of tool. Cause 3: Visual check WI did not clearly specify this defect location and boundary samples. There are risky the operator skip the NG part during inspection. A al inspection operator A Cleaning operator Final inspector miss the defect part Cleaning process External technician mix the debug part VB chip (Why happened?( (Occur path)", "COUNTERMEASURES": "1. Supplier add error-proof dedicated fixture to fix the length of tool with correct position. - Done 2:Supplier update the Non-confirmation control procedure, debug part must be scrap and mark with red marking. - Done Dec.25th.2018 3. Supplier update the optical inspection WI and issue boundary samples in line. --Done 4. Supplier internal process audit, they already added dedicated brusher to clean the inner surface of VB in E/Sep. .2018.", "EFFECT CONFIRMATION": "200% visual inspection in supplier side and last one month with safe launch. Trial run 10pcs chip samples and 50pcs normal part to verify the brush performance, all chip are completely wiped out. - Done Dec.25th.2018 No chips were found after 33680pcs sorting. -- Done", "FOLLOW UP ACTION": "Expand the visual defect lesson learn into PFMEA. Expand the this lesson learn to other VB supplier."}, "SEARCH PARAMETERS": {"KEY WORDS": ["CAF", "CQ3", "VB", "Asimco Beijing", "CGQ"], "KEY PHRASES": ["Dec.5th.2018", "CAF CQ3", "one piece injector", "vehicle testing", "The chips", "VB", "the seat sealing area", "injector", "Dec. 11st.2018", "Which supplier", "Asimco Beijing Picture", "2 - Containment action", "Dec.10th.2018", "Fast response", "customer", "the suspected part", "100% VB", "CGQ plant and supplier side", "No chips part"]}}