{"KEY DATAPOINTS": {"ID": "", "FILENAME": "A3_Sporadic_Framedropout.pdf", "DIVISION": "E", "BU": "CT", "PRODUCT LINE": "", "PRODUCT GROUP": "", "DEPARTMENT": "TEC", "LOCATION": "Schwalbach Regensburg", "AUTHOR": "Lyes Maouche  Co STPL", "SPONSOR": "Andreas Schnetz  PM", "TEAM LEADER": "Thomas Lakas", "START DATE": "2022-11-03T00:00:00", "END DATE": "2022-03-18T00:00:00", "LATEST UPDATE": "NaT", "PROBLEM DESCRIPTION": "Sporadic CAN frame dropouts existing in Pre-SW-versions of SE1500. This leads to a sporadic dropout of Message ESP21 and triggers toggling of vs SAE (raw value of vehicle speed), which leads to alternating values between 0 and 255 (replacement/substitute value).", "CURRENT CONDITION": "Sporadic CAN frame dropouts existing in Pre-SW-versions of SE1 Delivery of SW SE1500 to customer VW stopped", "TARGET CONDITION": "Identify the root cause of CAN frame / ESP21 dropouts and the the location of the failure (VT side or VW side). If failure is on VT side define timing for problem solution (SW correction) and allign it with overall SW timing for SE1500/SE1550, depending on severity of the problem", "ROOT CAUSE ANALYSIS": "Debugging Session identifies that the restbus simulation, delivery from customer VW, is the main root cause for toggling of the ESP_21 Message. Here the ESP_21 message is sent 3 times in a row within timing of overall - 10ms. Regular/correct case would be here that a message transfer every 20ms is present (only one event/message per 20ms). @ - 412317 CAN E4 ESP_21_SOK_Signatur_SOK_XIX_E3V_ACANFD 429913 CAN FD SP_21_XIX_E3V_ACANFD 430361 CAN : E4 ESP_21_SOK_Signatur_SOK_XIX_E3V_ACANFI 449567 CAN 1 FD ESP_21_XIX__E3V_ACANFD CAN 1 E4 ICAS(TX) ASG 2.2 (RX): Message CAN ESP_21_XIX_E3V_ACANFD ICAS(TX) Message CAN FD SP_21_XIX_E3V_ACANFD ICAS(TX) ASG 2.2 (RX): Message ICAS(TX) ASG 2.2 (RX): Signature 1 ICAS(TX ASG 2.2 (RX): Signature 2 19.531318 E4 ICAS(TX) ASG 2.2 (RX): Signature 3 19.533198 CAN 1 E4 CAN : FD ESP_21_XIX_E3V_ACANFD 19.535459 CAN 1 E4 ESP_21_SOK_Signatur_SOK_XIX_E3V_ACAN CAN 1 FD ESP_21_XIX_E3V_ACANFD 19.551877 CAN 1 E4 ESP_21_SOK_Signatur_SOK_XIX_E3V_ACANFD", "COUNTERMEASURES": "As the failure is caused by VW Restbus simulation a syncronisation with Customer will take place in regular \"Technikrunde\" on 18.03.2022. VT has no technical problem in deliverables/current SW Version! In general, a discussion on overall robustness of VW bus handling/concept needs to be done also. VT internal the usage of a missing message linker, which increases the robustness of the concept, was already discussed and afterwards denied by VW. This discussion needs to be refreshed till end of Q2/22 (Resp. CoRe SOK). Tracking is done via VW ASG 2.2 Project PAIL Al #182.", "EFFECT CONFIRMATION": "As there are no technical problems in VT deliverables the created IMS Issue 14600526 will be used for documentation of all performed actions. Also an investigation on a buffer behavior of ElektroBit deliverable SecOC will be handeled with this issue.", "FOLLOW UP ACTION": "As there are no technical problems in VT deliverables a lessons learned on VT side could not be performed, as the failure is fully triggered/caused by VW Restbus simulation. Also preventive Actions are not definable, as restbus simulation is under control of VW here."}, "SEARCH PARAMETERS": {"KEY WORDS": ["SE1500", "ESP21", "VW", "ESP_21", "E4", "ESP_21_SOK_Signatur_SOK_XIX_E3V_ACANFD", "SP_21_XIX_E3V_ACANFD\n430361", "ESP_21_SOK_Signatur_SOK_XIX_E3V_ACANFI", "2.2", "ESP_21_XIX_E3V_ACANFD", "ESP_21_SOK_Signatur_SOK_XIX_E3V_ACAN", "FD", "SE1500/SE1550"], "KEY PHRASES": ["Sporadic CAN frame dropouts", "Pre-SW-versions", "SE1500", "a sporadic dropout", "Message ESP21", "toggling", "vs SAE", "raw value", "vehicle speed", "alternating values", "0 and 255", "replacement/substitute value"]}}